gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_ACTION_6000.cpp

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_ACTION_6000.h"
#include "../DL698/SearchMeter_Record.h"

#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"
#include "../DL698/DL698_Uart.h"
#include "../DL698/DL698_SETLIB.h"
#include "../MS/msFILE.h"
#include "../MS/MS.h"
#include "../DL698/TASK.h"
#include "../Terminal698/Terminal_Init.h"


u32 ACTION_Add(DL698_SETLIB_TypeDef *pLib,u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 n;
	u32 Array;
	u32 LenRx;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(p8rx[4+0]==DataType_array)
	{//添加一组
		Array=p8rx[4+1];
		if(Array&0x80)
		{
			Array&=0x7f;
			if(LEN_RxAPDU<=(4+2+Array))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=2+Array;
			p8rx+=4+2;
			LEN_RxAPDU-=4+2+Array;
			i=Array;
			Array=0;
			while(i--)
			{
				Array<<=8;
				Array|=p8rx[0];
				p8rx+=1;
			}
		}
		else
		{
			if(LEN_RxAPDU<=(4+2))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=2;
			p8rx+=4+2;
			LEN_RxAPDU-=4+2;
		}
	}
	else
	{//添加更新一个
		if(LEN_RxAPDU<=(4+2))
		{
			UARTCtrl->DAR=9;//数据块不可用         （9）
			return 0;
		}
		Array=1;
		LenRx=0;
		p8rx+=4;
		LEN_RxAPDU-=4;
	}
	while(Array--)
	{
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_6016_2[];//事件采集方案
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_601C[];
		if((pLib==DL698_SETLIB_6016_2)||(pLib==DL698_SETLIB_601C))
		{
			//上报方案6016,601C有data数据类型，不比较数据类型
			i=Get_DL698DataLen_S(p8rx,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
		}
		else
		{
			i=Get_DL698DataLen(p8rx,(Attribute_TypeDef *)pLib->pDataType,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			if((i&0xff)==0)
			{
				UARTCtrl->DAR=7;//类型不匹配           （7）
				return 0;
			}
			i>>=8;
		}
		if(LEN_RxAPDU<i)
		{
			UARTCtrl->DAR=9;//数据块不可用         （9）
			return 0;
		}
		LenRx+=i;
		if(i>pLib->LENper)
		{
			UARTCtrl->DAR=8;//越界                 （8）
			return (LenRx<<16)+0;
		}
		if(p8rx[2]==DataType_unsigned)
		{
			n=p8rx[3];//取配置序号
		}
		else
		{
			n=(p8rx[3]<<8)+p8rx[4];//取配置序号
		}
		if(n>=(pLib->LENmax/pLib->LENper))
		{
			UARTCtrl->DAR=8;//越界（8）
			return (LenRx<<16)+0;
		}
		MW((u32)p8rx,pLib->Addr+(n*pLib->LENper),i);
		p8rx+=i;
	}
	return (LenRx<<16)+0;
}


u32 ACTION_Add_6000(DL698_SETLIB_TypeDef *pLib,u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 n;
	u32 Array;
	u32 LenRx;
	u8* p8;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(p8rx[4+0]==DataType_array)
	{//添加一组
		Array=p8rx[4+1];
		if(Array&0x80)
		{
			Array&=0x7f;
			if(LEN_RxAPDU<=(4+2+Array))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=2+Array;
			p8rx+=4+2;
			LEN_RxAPDU-=4+2+Array;
			i=Array;
			Array=0;
			while(i--)
			{
				Array<<=8;
				Array|=p8rx[0];
				p8rx+=1;
			}
		}
		else
		{
			if(LEN_RxAPDU<=(4+2))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=2;
			p8rx+=4+2;
			LEN_RxAPDU-=4+2;
		}
	}
	else
	{//添加更新一个
		if(LEN_RxAPDU<=(4+2))
		{
			UARTCtrl->DAR=9;//数据块不可用         （9）
			return 0;
		}
		Array=1;
		LenRx=0;
		p8rx+=4;
		LEN_RxAPDU-=4;
	}
	while(Array--)
	{
		//检查波特率
		p8=Get_Element(p8rx+5,2,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
		if(p8)
		{
			if((p8[1]>10)&&(p8[1]!=255))
			{
				UARTCtrl->DAR=255;
				return 0;
			}
		}

		//检查规约类型
	#if (USER%100)==0//台体测试
		p8=Get_Element(p8rx+5,3,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
		if(p8)
		{
			if(p8[1]>4)
			{
				UARTCtrl->DAR=255;
				return 0;
			}
		}
	#endif
		//检查接线方式
		p8=Get_Element(p8rx+5,8,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
		if(p8)
		{
			if(p8[1]>3)
			{
				UARTCtrl->DAR=255;
				return 0;
			}
		}
		//检查单元数据长度
		i=Get_DL698DataLen(p8rx,(Attribute_TypeDef *)pLib->pDataType,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
		if((i&0xff)==0)
		{
			UARTCtrl->DAR=7;//类型不匹配           （7）
			return 0;
		}
		i>>=8;
		if(LEN_RxAPDU<i)
		{
			UARTCtrl->DAR=9;//数据块不可用         （9）
			return 0;
		}
		LenRx+=i;
		if(i>pLib->LENper)
		{
			UARTCtrl->DAR=8;//越界                 （8）
			return (LenRx<<16)+0;
		}
		//检查配置序号
		if(p8rx[2]==DataType_unsigned)
		{
			n=p8rx[3];//取配置序号
		}
		else
		{
			n=(p8rx[3]<<8)+p8rx[4];//取配置序号
		}
		if(n>=(pLib->LENmax/pLib->LENper))
		{
			UARTCtrl->DAR=8;//越界                 （8）
			return (LenRx<<16)+0;
		}
		MW((u32)p8rx,pLib->Addr+(n*pLib->LENper),i);//nand
		//MW((u32)p8rx,ADDR_6000_SDRAM+(n*pLib->LENper),i);//sdram
		p8rx+=i;
	}
	return (LenRx<<16)+0;
}

u32 ADDR_6000_Check(void)//ADDR_6000档案电能表地址重复检查;返回:0=没重复,1=有重复,并自动删除重复序号
{
	u32 i;
	u32 n;
	u32 m;
	u32 f;
	u8* p8s;
	u8* p8d;
	u8* buff;
	ms_Type *ms;
	
	f=0;
	ms=Get_ms();
	p8s=(u8*)ms->ms_malloc(LENmax_6000);//动态分配我的内存堆
	ms->ms_free(p8s);//释放我的内存堆分配
	if(p8s)
	{
		buff=p8s;
		MR((u32)p8s,ADDR_6000,LENmax_6000);
		for(n=0;n<NUM_RMmax;n++)
		{
			if(p8s[0]==DataType_structure)
			{
				p8d=buff;
				for(m=0;m<NUM_RMmax;m++)
				{
					if(p8d[0]==DataType_structure)
					{
						for(i=0;i<6;i++)
						{
							if(p8s[10+i]!=p8d[10+i])
							{
								break;
							}
						}
						if(i>=6)
						{//重复
							if(n!=m)
							{//不是同一序号
								p8d[0]=0;//sdram
								MC(0,ADDR_6000+(m*LENper_6000),1);//nand
								f=1;
							}
						}
					}
					p8d+=LENper_6000;
				}
			}
			p8s+=LENper_6000;
		}
	}
	return f;
}



u32 ACTION_Del(DL698_SETLIB_TypeDef *pLib,u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法删除一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 n;
	u32 Array;
	u32 LenRx;
	UARTCtrl_TypeDef *UARTCtrl;
	
