gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_ACTION_6000.cpp
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(p8rx[4+0]==DataType_array)
	{//删除一组
		Array=p8rx[4+1];
		if(Array&0x80)
		{
			Array&=0x7f;
			if(LEN_RxAPDU<=(4+2+Array))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=2+Array;
			p8rx+=4+2;
			LEN_RxAPDU-=4+2+Array;
			i=Array;
			Array=0;
			while(i--)
			{
				Array<<=8;
				Array|=p8rx[0];
				p8rx+=1;
			}
		}
		else
		{
			if(LEN_RxAPDU<=(4+2))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=2;
			p8rx+=4+2;
			LEN_RxAPDU-=4+2;
		}
	}
	else
	{//删除一个
		if(LEN_RxAPDU<=(4+2))
		{
			UARTCtrl->DAR=9;//数据块不可用         （9）
			return 0;
		}
		Array=1;
		LenRx=0;
		p8rx+=4;
		LEN_RxAPDU-=4;
	}
	while(Array--)
	{
		if(LEN_RxAPDU<2)
		{
			UARTCtrl->DAR=9;//数据块不可用         （9）
			return 0;
		}
		if(p8rx[0]==DataType_unsigned)
		{
			n=p8rx[1];//取配置序号
			p8rx+=2;
			LenRx+=2;
		}
		else
		{
			n=(p8rx[1]<<8)+p8rx[2];//取配置序号
			p8rx+=3;
			LenRx+=3;
		}
		if(n<(pLib->LENmax/pLib->LENper))
		{
			MC(0,pLib->Addr+(n*pLib->LENper),1);
		}
	}
	return (LenRx<<16)+0;
}

//采集档案配置表
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_6000_2_0[];
u32 ACTION_6000(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 x;
	u32 Method;
	u32 Array;
	u32 LenRx;
	u32 LenTx;
	u8 *p8;
	UARTCtrl_TypeDef *UARTCtrl;
	DL698_SETLIB_TypeDef *pLib;
	
	pLib=(DL698_SETLIB_TypeDef *)DL698_SETLIB_6000_2_0;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	Method=p8rx[2];
	LenTx=0;
	switch(Method)
	{
		case 127://方法127：Add（采集档案配置单元）添加一个采集档案配置单元，配置单元的信息中基本信息必须是完整的。
			if(p8rx[4]!=DataType_structure)
			{
				LenRx= Get_DL698DataLen_S(p8rx,0);//得到DL698数据类型长度(包括:类型字节和数据)
				UARTCtrl->DAR=255;//数据访问结果
				return (LenRx<<16)+LenTx;
			}
			i=ACTION_Add_6000((DL698_SETLIB_TypeDef *)DL698_SETLIB_6000_2_0,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
		#if (USER%100)!=0
			x=ADDR_6000_Check();//ADDR_6000档案电能表地址重复检查;返回:0=没重复,1=有重复,并自动删除重复序号
			if(x)
			{
				UARTCtrl->DAR=255;//数据访问结果
			}
		#endif
			return i;
		case 128://方法128：AddBatch（array 采集档案配置单元）批量添加采集档案配置单元。
			i=ACTION_Add_6000((DL698_SETLIB_TypeDef *)DL698_SETLIB_6000_2_0,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
		#if (USER%100)!=0
			x=ADDR_6000_Check();//ADDR_6000档案电能表地址重复检查;返回:0=没重复,1=有重复,并自动删除重复序号
			if(x)
			{
				UARTCtrl->DAR=255;//数据访问结果
			}
		#endif
			return i;
		case 129://方法129：Update（配置序号，基本信息）更新配置单元的基本信息对象
			Method=(p8rx[4+3]<<8)+p8rx[4+4];//取配置序号
			if(Method>=NUM_RMmax)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+LenTx;
			}
			if(LEN_RxAPDU<(4+5))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=5;
			p8rx+=4+5;
			LEN_RxAPDU-=4+5;
			LenRx=Get_DL698DataLen(p8rx,(Attribute_TypeDef *)pLib->pDataType,2,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			if((LenRx&0xff)==0)
			{
				UARTCtrl->DAR=7;//类型不匹配           （7）
				return 0;
			}
			LenRx>>=8;
			if(LEN_RxAPDU<LenRx)
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			//原长度
			i=Get_DL698DataLen((u8*)(ADDR_6000+(Method*LENper_6000)+5),(Attribute_TypeDef *)pLib->pDataType,2,LENper_6000);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			i>>=8;
			if((i>LENper_6000)||(i<2))
			{
				i=2;
			}
			//后续数据长度1
			Array=Get_DL698DataLen((u8*)(ADDR_6000+(Method*LENper_6000)+5+i),(Attribute_TypeDef *)pLib->pDataType,11,LENper_6000);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			Array>>=8;
			if((Array>LENper_6000)||(Array<2))
			{
				Array=2;
			}
			//后续数据长度2
			x=Get_DL698DataLen((u8*)(ADDR_6000+(Method*LENper_6000)+5+i+Array),(Attribute_TypeDef *)pLib->pDataType,16,LENper_6000);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			x>>=8;
			if((x>LENper_6000)||(x<2))
			{
				x=2;
			}
			x+=Array;
			if((LenRx+x)>LENper_6000)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+LenTx;
			}
			//新数据
			MR(ADDR_128KDATABUFF,(u32)p8rx,LenRx);
			//原后续数据
			MR(ADDR_128KDATABUFF+LenRx,ADDR_6000+(Method*LENper_6000)+5+i,x);
			//写
			MW(ADDR_128KDATABUFF,ADDR_6000+(Method*LENper_6000)+5,LenRx+x);
			return (LenRx<<16)+LenTx;
		case 130://方法130：Update（配置序号，扩展信息，附属信息）更新配置单元的扩展信息以及附属信息，对象为NULL表示不更新。
			Method=(p8rx[4+3]<<8)+p8rx[4+4];//取配置序号
			if(Method>=NUM_RMmax)
			{
				UARTCtrl->DAR=8;//越界                 （8）
				return (LenRx<<16)+LenTx;
			}
			if(LEN_RxAPDU<(4+5))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=5;
			p8rx+=4+5;
			LEN_RxAPDU-=4+5;
	//扩展信息
			if(p8rx[0]==0)
			{//对象为NULL表示不更新
				if(LEN_RxAPDU<1)
				{
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
				p8rx+=1;
				LenRx=1;
				LEN_RxAPDU-=1;
			}
			else
			{
				LenRx=Get_DL698DataLen(p8rx,0,11,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				if((LenRx&0xff)==0)
				{
					UARTCtrl->DAR=7;//类型不匹配           （7）
					return 0;
				}
				LenRx>>=8;
				if(LEN_RxAPDU<LenRx)
				{
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
				//原数据偏移
				Array=Get_DL698DataLen((u8*)ADDR_6000+(Method*LENper_6000)+5,0,2,LENper_6000);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				Array>>=8;
				if((Array>LENper_6000)||(Array<2))
				{
					Array=2;
				}
				Array+=5;
				//原长度
				i=Get_DL698DataLen((u8*)ADDR_6000+(Method*LENper_6000)+Array,0,11,LENper_6000);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				i>>=8;
				if((i>LENper_6000)||(i<2))
				{
					i=2;
				}
				//后继数据长度
				x=Get_DL698DataLen((u8*)ADDR_6000+(Method*LENper_6000)+Array+i,0,16,LENper_6000);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				if((x>LENper_6000)||(x<2))
				{
					x=2;
				}
				if((Array+LenRx+x)>LENper_6000)
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+LenTx;
				}
				//新数据
				MR(ADDR_128KDATABUFF,(u32)p8rx,LenRx);
				//原后续数据
				MR(ADDR_128KDATABUFF+LenRx,ADDR_6000+(Method*LENper_6000)+Array+i,x);
				//写
				MW(ADDR_128KDATABUFF,ADDR_6000+(Method*LENper_6000)+Array,LenRx+x);
				p8rx+=LenRx;
				LEN_RxAPDU-=LenRx;
			}
		//附属信息
			if(p8rx[0]==0)
			{//对象为NULL表示不更新
				if(LEN_RxAPDU<1)
				{
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
				p8rx+=1;
				LenRx=1;
				LEN_RxAPDU-=1;
			}
			else
			{
				LenRx=Get_DL698DataLen(p8rx,0,16,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				if((LenRx&0xff)==0)
				{
					UARTCtrl->DAR=7;//类型不匹配           （7）
					return 0;
				}
				LenRx>>=8;
				if(LEN_RxAPDU<LenRx)
				{
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
				//原数据偏移
				Array=Get_DL698DataLen((u8*)ADDR_6000+(Method*LENper_6000)+5,0,2,LENper_6000);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				Array>>=8;
				if((Array>LENper_6000)||(Array<2))
				{
					Array=2;
				}
				Array+=5;
				i=Get_DL698DataLen((u8*)ADDR_6000+(Method*LENper_6000)+Array,0,11,LENper_6000);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				i>>=8;
				if((i>LENper_6000)||(i<2))
				{
					i=2;
				}
				Array+=i;
				if((Array+LenRx)>LENper_6000)
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+LenTx;
				}
				//写
				MW((u32)p8rx,ADDR_6000+(Method*LENper_6000)+Array,LenRx);
				p8rx+=LenRx;
				LEN_RxAPDU-=LenRx;
			}
			return (LenRx<<16)+LenTx;
		case 131://方法131：Delete（配置序号）删除配置单元，通过配置序号删除
			i=ACTION_Del((DL698_SETLIB_TypeDef *)DL698_SETLIB_6000_2_0,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法删除一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 132://方法132：Delete（基本信息）删除配置单元，通过基本信息对象删除
			p8rx+=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<(4+LenRx))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			x=0;//总计数
			while(1)
			{
				if(x>=NUM_RMmax)
				{
					break;
				}
				MR(ADDR_128KDATABUFF,ADDR_6000+(x*LENper_6000),LEN_128KDATABUFF);
				p8=(u8*)ADDR_128KDATABUFF+5;
				for(i=0;i<(LEN_128KDATABUFF/LENper_6000);i++)
				{
					if(x>=NUM_RMmax)
					{
						break;
					}
				//比较
					for(Array=0;Array<LenRx;Array++)
					{
						if(p8rx[Array]!=p8[Array])
						{
							break;
						}
					}
					if(Array<LenRx)
					{
						p8+=LENper_6000;
						x++;
						continue;
					}
				//清配置
					MC(0,ADDR_6000+(x*LENper_6000),1);//删除时structure的数据单元清为0(NULL)
					p8+=LENper_6000;
					x++;
				}
			}
			return (LenRx<<16)+LenTx;
		case 133://方法133：Delete（通信地址， 端口号）删除配置单元，通过通信地址及端口删除
			//structure
			//{
			//	TSA
			//	OAD
			//}
			p8rx+=4;
			LenRx=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			LenRx>>=8;
			if(LEN_RxAPDU<(4+LenRx))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			x=0;//总计数
			while(1)
			{
				if(x>=NUM_RMmax)
				{
					break;
				}
				MR(ADDR_128KDATABUFF,ADDR_6000+(x*LENper_6000),LEN_128KDATABUFF);
				p8=(u8*)ADDR_128KDATABUFF;
				for(i=0;i<(LEN_128KDATABUFF/LENper_6000);i++)
				{
					if(x>=NUM_RMmax)
					{
						break;
					}
				//比较TSA
					Method=2;//接收数据偏移
					Array=7;//FLASH数据偏移
					if(p8rx[Method]==DataType_NULL)
					{
						Method++;//接收数据偏移
						Array+=p8[Array]+1;//FLASH数据偏移
						Array+=4;
					}
					else
					{
						if(p8rx[Method]==DataType_TSA)
						{
							Method++;//接收数据偏移
							Array++;//FLASH数据偏移
							LenTx=p8rx[Method]+1;//比较字节数
							while(LenTx)
							{
								if(p8rx[Method]!=p8[Array])
								{
									break;
								}
								LenTx--;
								Method++;//接收数据偏移
								Array++;//FLASH数据偏移
							}
							if(LenTx)
							{//不相同
								p8+=LENper_6000;
								x++;
								continue;
							}
							Array+=4;//FLASH数据偏移
						}
						else
						{
							UARTCtrl->DAR=9;//数据块不可用         （9）
							return 0;
						}
					}
				//比较OAD
					if(p8rx[Method]!=DataType_NULL)
					{
						if(p8rx[Method]!=DataType_OAD)
						{
							UARTCtrl->DAR=9;//数据块不可用         （9）
							return 0;
						}
						LenTx=4;
						while(LenTx)
						{
							LenTx--;
							Method++;//接收数据偏移
							Array++;//FLASH数据偏移
							if(p8rx[Method]!=p8[Array])
							{//不相同
								break;
							}
						}
						if(LenTx)
						{//不相同
							p8+=LENper_6000;
							x++;
							continue;
						}
					}
					//清配置
					MC(0,ADDR_6000+(x*LENper_6000),1);//删除时structure的数据单元清为0(NULL)
					p8+=LENper_6000;
					x++;
				}
			}
			LenTx=0;
			return (LenRx<<16)+LenTx;
		case 134://方法134：Clear()清空采集档案配置表
			if(p8rx[4]!=0)
			{
				UARTCtrl->DAR=255;
				return 0;
			}
			MC(0,ADDR_6000,LENper_6000*NUM_RMmax);
			LenRx=1;
			p8rx+=4+1;
			LEN_RxAPDU-=4+1;
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//搜表
u32 ACTION_6002(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	u8* p8;
	
