gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_ACTION_6000.cpp
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	i=p8rx[2];
	LenTx=0;
	LenRx=0;
	p8rx+=4;
	switch(i)
	{
		case 127://方法127：实时启动搜表（搜表时长）
//			MW((u32)p8rx,ADDR_6002_127,3);
//			LenTx=MRR(ADDR_6002_8+9,1);
//			if(LenTx==2)
//			{//每次搜表前清空
//				DEL_SearchMeter_Record(3);//清空搜表结果;入口：FileID=3全部搜表结果，=4跨台区搜表结果
//				DEL_SearchMeter_Record(4);//清空搜表结果;入口：FileID=3全部搜表结果，=4跨台区搜表结果
//			}
			LenRx=(p8rx[1]<<8)|p8rx[2];
			if(LenRx==0)
			{//自动搜表持续时间分，0表示不限时间直至搜表结束
				Terminal_Ram->AutoSearch_M_Timer=65535;//2 自动搜表允许时间分定时器
			}
			else
			{
				Terminal_Ram->AutoSearch_M_Timer=LenRx;//2 自动搜表允许时间分定时器
			}
			
		#if EnRS485AutoSearchMeter==1//0=否,1=是;允许RS485口自动搜表
			MWR(0x03aaaaaaaaaa00,ADDR_AutoSearchMeter_Start+(LEN_PerPortAutoSearchMeter*0),7);//RS485-1初始搜表地址
			MWR(0x03aaaaaaaaaa00,ADDR_AutoSearchMeter_Start+(LEN_PerPortAutoSearchMeter*1),7);//RS485-2初始搜表地址
			
			UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_1PORT);
			UARTCtrl->AutoSearchTime=LenRx;//自动搜表持续时间分，0表示不限时间直至搜表结束
			UARTCtrl->TaskID=(RMTASKnoPOWER<<8)+3;//方案号3=实时启动搜表
			UARTCtrl->AutoSearchTask=1;//自动搜表任务:0=空,1=等待,2...过程
		
			UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_2PORT);
			UARTCtrl->AutoSearchTime=LenRx;//自动搜表持续时间分，0表示不限时间直至搜表结束
			UARTCtrl->TaskID=(RMTASKnoPOWER<<8)+3;//方案号3=实时启动搜表
			UARTCtrl->AutoSearchTask=1;//自动搜表任务:0=空,1=等待,2...过程
		#endif
			
		#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_4PORT);
			UARTCtrl->AutoSearchTime=LenRx;//自动搜表持续时间分，0表示不限时间直至搜表结束
			UARTCtrl->TaskID=(RMTASKnoPOWER<<8)+3;//方案号3=实时启动搜表
			UARTCtrl->AutoSearchTask=1;//自动搜表任务:0=空,1=等待,2...过程
		#endif
			MR(ADDR_DATABUFF,ADDR_6002_8,LENmax_6002_8);//搜表参数
			p8=(u8*)ADDR_DATABUFF;
			if(p8[9]==2)
			{//每次搜表前清空
				DEL_SearchMeter_Record(3);//清空搜表结果;入口：FileID=3全部搜表结果，=4跨台区搜表结果
				DEL_SearchMeter_Record(4);//清空搜表结果;入口：FileID=3全部搜表结果，=4跨台区搜表结果
			}
		
			LenTx=0;
			LenRx=3;
			return (LenRx<<16)+LenTx;
		case 128://方法128：清空搜表结果()
			DEL_SearchMeter_Record(3);//清空搜表结果;入口：FileID=3全部搜表结果，=4跨台区搜表结果
			return (LenRx<<16)+LenTx;
		case 129://方法129：清空跨台区搜表结果()
			DEL_SearchMeter_Record(4);//清空搜表结果;入口：FileID=3全部搜表结果，=4跨台区搜表结果
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}



//任务配置表
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_6012_2_0[];
u32 ACTION_6012(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	msFILE_TypeDef *file;
	ms_Type *ms;
	u32 filename;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	Method=p8rx[2];
	LenTx=0;
	switch(Method)
	{
		case 3://清空记录表
			//删除记录文件
			ms=Get_ms();
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
			for(filename=0;filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM);filename++)
			{
				if(filename==recordFILENAMEmax_FLASH)
				{
					file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
				}
				if(file->BLOCK_ENTRY)
				{
					//文件分类:0=普通采集方案数据记录
					if((file->FILEID&0xff)==0)
					{
						//删除
						i=filename;
						if(i>=recordFILENAMEmax_FLASH)
						{
							i-=recordFILENAMEmax_FLASH;
							i+=FILENAMEmax_FLASH;
						}
						ms->msfile_Delete(i);
					}
				}
				file++;
			}
			LenRx=1;
			return (LenRx<<16)+LenTx;
		case 127://方法127：Add（array 任务配置单元）添加或更新一组任务配置单元。
			i=ACTION_Add((DL698_SETLIB_TypeDef *)DL698_SETLIB_6012_2_0,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 128://方法128：Delete（array 任务ID）删除一组配置单元。
		#if (USER/100)==0
		//一致性测试软件bug
			if(p8rx[4+3]==1)
			{
				p8rx[4+3]=10;
			}
			i=ACTION_Del((DL698_SETLIB_TypeDef *)DL698_SETLIB_6012_2_0,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法删除一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		#else
			i=ACTION_Del((DL698_SETLIB_TypeDef *)DL698_SETLIB_6012_2_0,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法删除一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		#endif
		case 129://方法129：Clear()清空任务配置表。
			MC(0,ADDR_6012_2,LENper_6012_2*NUMmax_6012_2);
//		#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
//			//电科院并发抄表测试需要，清空任务需立即执行
//			FLASHtoSDRAM();//参数FLASHtoSDRAM
//			TASK(RS485_4PORT,1);//任务;入口:RM=0上报任务,RM=1采集任务
//		#endif
			LenRx=1;
			return (LenRx<<16)+LenTx;
		case 130://方法130：Update(任务ID，状态)更新任务状态。
			//::==DataType_structure
			//{
				//unsigned
				//emun
			//}
		#if (USER/100)==0
		//一致性测试软件bug
			Method=p8rx[4+3];//取任务ID
			if(Method==10)
			{
				MWR(10,ADDR_6012_2+(1*LENper_6012_2)+3,1);//任务号1变为10
				MWR(2,ADDR_6012_2+(1*LENper_6012_2)+35,1);//状态1变为2
			}
			else
			{
				if(Method<NUMmax_6012_2)
				{
					i=p8rx[4+5];
					MWR(i,ADDR_6012_2+(Method*LENper_6012_2)+35,1);
				}
			}
		#else
			Method=p8rx[4+3];//取任务ID
			if(Method<NUMmax_6012_2)
			{
				i=p8rx[4+5];
				MWR(i,ADDR_6012_2+(Method*LENper_6012_2)+35,1);
			}
		#endif
			LenRx=4;
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//普通采集方案集
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_6014_2_0[];
u32 ACTION_6014(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 x;
	u32 Method;
	u32 array;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	u8* p8;
	u32 Len0;
	u32 Len1;
	u32 Len2;
	
	x=x;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	Method=p8rx[2];
	LenTx=0;
	switch(Method)
	{
		case 127://方法127：Add（array 普通采集方案）添加或更新一组普通采集方案。
			i=ACTION_Add((DL698_SETLIB_TypeDef *)DL698_SETLIB_6014_2_0,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 128://方法128：Delete（array 方案编号）删除一组普通采集方案。
			i=ACTION_Del((DL698_SETLIB_TypeDef *)DL698_SETLIB_6014_2_0,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法删除一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 129://方法129：Clear()清空普通采集方案集。
			MC(0,ADDR_6014,LENper_6014*NUMmax_6014);
			LenRx=1;
			return (LenRx<<16)+LenTx;
		case 130://方法130：Set_CSD（方案编号，array CSD）重置方案的记录列选择。
//structure
//{
//unsigned 方案编号
//array CSD
//}
			p8rx+=4;
			i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
			if((i&0xff)==0)
			{
				UARTCtrl->DAR=7;//类型不匹配           （7）
				return 0;
			}
			i>>=8;
			if(LEN_RxAPDU<(i+4))
			{
				UARTCtrl->DAR=9;//数据块不可用（9）
				return 0;
			}
			LenRx=i;
			array=1;
			while(array--)
			{
				Method=p8rx[3];//取方案编号
				if(Method>=NUMmax_6014)
				{
					UARTCtrl->DAR=8;//越界（8）
					break;
				}
				else
				{
				#if LENper_6014>LEN_DATABUFF
					#error
				#endif
					MR(ADDR_DATABUFF,ADDR_6014+(Method*LENper_6014),LENper_6014);
					p8=Get_Element((u8 *)ADDR_DATABUFF,4,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
					if(p8==0)
					{
						UARTCtrl->DAR=255;
						break;
					}
					//原CSD前数据长度
					Len0=(u32)p8-ADDR_DATABUFF;
					//原CSD数据长度
					Len1=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
					//原后续数据长度
					Len2=Get_DL698DataLen_S(p8+Len1,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
					Len2+=2;
					//新CSD数据长度
					i=Get_DL698DataLen_S(p8rx+4,0);//得到DL698数据类型长度(包括:类型字节和数据)
					if((Len0+i+Len2)<=LENper_6014)
					{
						MW((u32)p8rx+4,ADDR_6014+(Method*LENper_6014)+Len0,i);
						//写回原后续数据
						MW(ADDR_DATABUFF+Len0+Len1,ADDR_6014+(Method*LENper_6014)+Len0+i,Len2);
					}
					else
					{
						UARTCtrl->DAR=8;//越界（8）
						break;
					}
				}
				i=Get_DL698DataLen_S(p8rx,0);//得到DL698数据类型长度(包括:类型字节和数据)
				p8rx+=i;
			}
			return (LenRx<<16)+LenTx;
	#if (USER/100)==9//河南扩展
		case 200:
//方法200：Set_MS（参数）
//参数∷=structure
//{
//  方案编号      unsigned，
//	电能表集合    MS
//}
//重置方案的电能表集合。
			p8rx+=4;
			Method=p8rx[3];//取方案号
			if(Method>=NUMmax_6014)
			{
				UARTCtrl->DAR=8;//越界（8）
				return 0;
			}
		#if LENper_6014>LEN_DATABUFF
			#error
		#endif
			MR(ADDR_DATABUFF,ADDR_6014+(Method*LENper_6014),LENper_6014);
			//计算电能表集合MS后的存储时标选择 enum
			p8=Get_Element((u8 *)ADDR_DATABUFF,6,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
			if(p8==0)
			{
				UARTCtrl->DAR=9;//数据块不可用 （9）
				return 0;
			}
			x=p8[0]|(p8[1]<<8);//保护原数据
			//计算电能表集合MS开始地址
			p8=Get_Element((u8 *)ADDR_DATABUFF,5,0,0);//计算元素地址(虚拟地址指针),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
			if(p8==0)
			{
				UARTCtrl->DAR=9;//数据块不可用（9）
				return 0;
			}
			LenRx=Get_DL698DataLen_S(p8rx+4,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
			if(((u32)p8+LenRx+2)>(ADDR_DATABUFF+LEN_DATABUFF))
			{
				UARTCtrl->DAR=9;//数据块不可用（9）
				return 0;
			}
			MW((u32)p8rx+4,(u32)p8,LenRx);
			p8+=LenRx;
			p8[0]=x;//恢复原数据
			p8[1]=x>>8;
			p8+=2;
			if((u32)p8>=ADDR_DATABUFF)
			{
				i=(u32)p8-ADDR_DATABUFF;
				if(i>LENper_6014)
				{
					UARTCtrl->DAR=9;//数据块不可用（9）
					return 0;
				}
				MW(ADDR_DATABUFF,ADDR_6014+(Method*LENper_6014),i);
			}
			LenRx+=4;
			return (LenRx<<16)+LenTx;
	#endif
		default:
			UARTCtrl->DAR=6;//对象不存在（6）
			return 0;
	}
}

