gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_ACTION_6000.cpp
//事件采集方案集
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_6016_2[];
u32 ACTION_6016(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	DL698_SETLIB_TypeDef *pLib;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	Method=p8rx[2];
	LenTx=0;
	switch(Method)
	{
		case 127://方法127：Add（array 事件采集方案）添加或更新一组事件采集方案。
			i=ACTION_Add((DL698_SETLIB_TypeDef *)DL698_SETLIB_6016_2,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 128://方法128：Delete（array 方案编号）删除一组事件采集方案。
			i=ACTION_Del((DL698_SETLIB_TypeDef *)DL698_SETLIB_6016_2,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法删除一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 129://方法129：Clear()清空事件采集方案集。
			MC(0,ADDR_6016,LENper_6016*NUMmax_6016);
			LenRx=1;
			return (LenRx<<16)+LenTx;
		case 130://方法130：UpdateReportFlag(方案编号，上报标识)上报标识∷=bool
//structure
//{
//unsigned 方案编号
//bool
//}
			if(LEN_RxAPDU<(4+6))
			{
				UARTCtrl->DAR=9;//数据块不可用         （9）
				return 0;
			}
			LenRx=6;
			Method=p8rx[4+3];//取方案编号
			if(Method>=NUMmax_6016)
			{
				UARTCtrl->DAR=8;//越界                 （8）
			}
			else
			{
				pLib=(DL698_SETLIB_TypeDef *)DL698_SETLIB_6016_2;
				i=Get_DL698DataLen((u8*)ADDR_6016+(Method*LENper_6016),(Attribute_TypeDef *)pLib->pDataType,0,LENper_6016);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				i>>=8;
				if(i>5)
				{
					i-=5;
					MW((u32)p8rx+4+4,ADDR_6016+(Method*LENper_6016)+i,2);
				}
			}
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//透明方案集
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_6018[];
u32 ACTION_6018(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	Method=p8rx[2];
	LenTx=0;
	switch(Method)
	{
		case 127://方法127：Add（透明方案）添加更新一个透明方案或添加一组方案内容。
			i=ACTION_Add((DL698_SETLIB_TypeDef *)DL698_SETLIB_6018,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 128://方法128：AddMeterFrame（方案编号，通信地址，方案控制标志，方案报文集）添加一组报文。
			UARTCtrl->DAR=6;//对象不存在           （6）
			return LenTx+(LenRx<<16);
		case 129://方法129：Delete（方案编号，array 通信地址）删除一个方案的一组方案内容。
			UARTCtrl->DAR=6;//对象不存在           （6）
			return (LenRx<<16)+LenTx;
		case 130://方法130：Delete（array 方案编号）删除一组透明方案。
			i=ACTION_Del((DL698_SETLIB_TypeDef *)DL698_SETLIB_6018,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法删除一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 131://方法131：Clear()清空透明方案集。
			MC(0,ADDR_6018,LENper_6018*NUMmax_6018);
			//同时清空结果集
			//MC(0,ADDR_601A,LENper_601A*NUMmax_601A);
			LenRx=1;
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//上报方案集
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_601C[];
u32 ACTION_601C(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	Method=p8rx[2];
	LenTx=0;
	switch(Method)
	{
		case 127://方法127：Add（array 上报方案）添加或更新一组上报方案。
			i=ACTION_Add((DL698_SETLIB_TypeDef *)DL698_SETLIB_601C,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法增加一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 128://方法128：Delete（array 方案编号）删除一组上报方案。
			i=ACTION_Del((DL698_SETLIB_TypeDef *)DL698_SETLIB_601C,PORTn,p8rx,LEN_RxAPDU,p8tx,LENmax_TxSPACE);//方法删除一个或一组设置数据;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
			return i;
		case 129://方法129：Clear()清空上报方案集。
			MC(0,ADDR_601C,LENper_601C*NUMmax_601C);
			LenRx=1;
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}

//采集规则库
extern const DL698_SETLIB_TypeDef  DL698_SETLIB_601E[];
u32 Search_LIB601E_OAD(u32 OAD)//从采集规则库中搜索OAD的配置序号(从0开始),返回值>=NUMmax_601E表示没找到
{
	u32 i;
	u32 x;
	u32 n;
	u8 *p8;
	
	n=0;
	while(1)
	{
		if(n>=NUMmax_601E)
		{
			return n;
		}
		MR(ADDR_128KDATABUFF,ADDR_601E+(n*LENper_601E),LEN_128KDATABUFF);
		p8=(u8*)ADDR_128KDATABUFF;
		for(i=0;i<(LEN_128KDATABUFF/LENper_601E);i++)
		{
			if(n>=NUMmax_601E)
			{
				return n;
			}
			if(p8[0]==DataType_structure)
			{//删除时structure的数据单元清为0(NULL)
				x=(p8[3]<<24)+(p8[4]<<16)+(p8[5]<<8)+p8[6];//取CSD
				if(x==OAD)
				{
					return n;
				}
			}
			n++;
			p8+=LENper_601E;
		}
	}
}
u32 Search_LIB601E_SPACE(void)//从采集规则库中搜索第1个无配置的序号(从0开始),返回值>=NUMmax_601E表示没找到
{
	u32 i;
	u32 n;
	u8 *p8;
	
	n=0;
	while(1)
	{
		if(n>=NUMmax_601E)
		{
			return n;
		}
		MR(ADDR_128KDATABUFF,ADDR_601E+(n*LENper_601E),LEN_128KDATABUFF);
		p8=(u8*)ADDR_128KDATABUFF;
		for(i=0;i<(LEN_128KDATABUFF/LENper_601E);i++)
		{
			if(n>=NUMmax_601E)
			{
				return n;
			}
			if(p8[0]==0)
			{//删除时structure的数据单元清为0(NULL)
				return n;
			}
			n++;
			p8+=LENper_601E;
		}
	}
}
u32 ACTION_601E(u32 PORTn,u8 *p8rx,u32 LEN_RxAPDU,u8 *p8tx,u32 LENmax_TxSPACE)//方法;返回:b31-b16接收区的数据长度(不包括4字节OMD),b15-b0填入发送区的需返回数据长度(不包括4字节OMD),数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 n;
	u32 Array;
	u32 Method;
	u32 LenRx;
	u32 LenTx;
	UARTCtrl_TypeDef *UARTCtrl;
	DL698_SETLIB_TypeDef *pLib;
	
	pLib=(DL698_SETLIB_TypeDef *)DL698_SETLIB_601E;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	Method=p8rx[2];
	LenTx=0;
	switch(Method)
	{
		case 127://方法127：Add（array 采集规则）添加或更新一组采集规则。
			if(p8rx[4+0]==DataType_array)
			{//添加一组
				Array=p8rx[4+1];
				if(Array&0x80)
				{
					Array&=0x7f;
					if(LEN_RxAPDU<=(4+2+Array))
					{
						UARTCtrl->DAR=9;//数据块不可用         （9）
						return 0;
					}
					LenRx=2+Array;
					p8rx+=4+2;
					LEN_RxAPDU-=4+2+Array;
					i=Array;
					Array=0;
					while(i--)
					{
						Array<<=8;
						Array|=p8rx[0];
						p8rx+=1;
					}
				}
				else
				{
					if(LEN_RxAPDU<=(4+2))
					{
						UARTCtrl->DAR=9;//数据块不可用         （9）
						return 0;
					}
					LenRx=2;
					p8rx+=4+2;
					LEN_RxAPDU-=4+2;
				}
			}
			else
			{//添加更新一个
				if(LEN_RxAPDU<=(4+2))
				{
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
				Array=1;
				LenRx=0;
				p8rx+=4;
				LEN_RxAPDU-=4;
			}
			while(Array--)
			{
				i=Get_DL698DataLen(p8rx,(Attribute_TypeDef *)pLib->pDataType,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				if((i&0xff)==0)
				{
					UARTCtrl->DAR=7;//类型不匹配           （7）
					return 0;
				}
				i>>=8;
				if(LEN_RxAPDU<i)
				{
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
				LenRx+=i;
				if(i>pLib->LENper)
				{
					UARTCtrl->DAR=8;//越界                 （8）
					return (LenRx<<16)+0;
				}
				n=(p8rx[3]<<24)+(p8rx[4]<<16)+(p8rx[5]<<8)+p8rx[6];//取OAD
				n=Search_LIB601E_OAD(n);//从采集规则库中搜索OAD的配置序号(从0开始),返回值>=NUMmax_601E表示没找到
				if(n>=NUMmax_601E)
				{
					n=Search_LIB601E_SPACE();//从采集规则库中搜索第1个无配置的序号(从0开始),返回值>=NUMmax_601E表示没找到
					if(n>=NUMmax_601E)
					{
						UARTCtrl->DAR=8;//越界                 （8）
						return (LenRx<<16)+0;
					}
				}
				MW((u32)p8rx,pLib->Addr+(n*pLib->LENper),i);
			}
			return (LenRx<<16)+0;
		case 128://方法128：Delete(array CSD)删除一组采集规则。
			if(p8rx[4+0]==DataType_array)
			{//删除一组
				Array=p8rx[4+1];
				if(Array&0x80)
				{
					Array&=0x7f;
					if(LEN_RxAPDU<=(4+2+Array))
					{
						UARTCtrl->DAR=9;//数据块不可用         （9）
						return 0;
					}
					LenRx=2+Array;
					p8rx+=4+2;
					LEN_RxAPDU-=4+2+Array;
					i=Array;
					Array=0;
					while(i--)
					{
						Array<<=8;
						Array|=p8rx[0];
						p8rx+=1;
					}
				}
				else
				{
					if(LEN_RxAPDU<=(4+2))
					{
						UARTCtrl->DAR=9;//数据块不可用         （9）
						return 0;
					}
					LenRx=2;
					p8rx+=4+2;
					LEN_RxAPDU-=4+2;
				}
			}
			else
			{//删除一个
				if(LEN_RxAPDU<=(4+2))
				{
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
				Array=1;
				LenRx=0;
				p8rx+=4;
				LEN_RxAPDU-=4;
			}
			while(Array--)
			{
				i=Get_DL698DataLen(p8rx,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
				if((i&0xff)==0)
				{
					UARTCtrl->DAR=7;//类型不匹配           （7）
					return 0;
				}
				i>>=8;
				if(LEN_RxAPDU<i)
				{
					UARTCtrl->DAR=9;//数据块不可用         （9）
					return 0;
				}
				n=(p8rx[2]<<24)+(p8rx[3]<<16)+(p8rx[4]<<8)+p8rx[5];//取OAD
				n=Search_LIB601E_OAD(n);//从采集规则库中搜索OAD的配置序号(从0开始),返回值>=NUMmax_601E表示没找到
				if(n<NUMmax_601E)
				{
					MC(0,pLib->Addr+(n*pLib->LENper),1);
				}
				LenRx+=i;
				p8rx+=i;
			}
			return (LenRx<<16)+0;
		case 129://方法129：Clear()清空采集规则库。
			MC(0,ADDR_601E,LENper_601E*NUMmax_601E);
			LenRx=1;
			return (LenRx<<16)+LenTx;
		default:
			UARTCtrl->DAR=6;//对象不存在           （6）
			return 0;
	}
}




























